In [1]:
import pandas as pd

#### 1. friend_list.csv 파일을 불러와서 상위5개만 출력해 보세요.

In [2]:
df = pd.read_csv('../data/friend_list.csv')
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

#### 2. friend_list.txt 파일을 불러와서 상위 5개만 출력해 보세요.

In [3]:
df_txt = pd.read_csv('../data/friend_list.txt')
df_txt.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

#### 3. friend_list_tab.txt 파일을 불러와서 상위 5개만 출력해 보세요.

In [4]:
df_friend_list_tab = pd.read_csv('../data/friend_list_tab.txt')
df_friend_list_tab.head()

         name\tage\tjob
0     John\t20\tstudent
1  Jenny\t30\tdeveloper
2     Nate\t30\tteacher
3    Julia\t40\tdentist
4    Brian\t45\tmanager

#### 4. 헤더가 없는 friend_list_no_head.csv 파일의 첫번째 데이터가 헤더로 들어가지 않도록 불러와 보세요.

In [5]:
df_friend_no_head = pd.read_csv('../data/friend_list_no_head.csv')
# df_friend_no_head

In [6]:
df_friend_no_head_change = df_friend_no_head.shift(1)
df_friend_no_head_change.loc[0] = ['John', 20, 'student']
df_friend_no_head_change.columns = ['name', 'age', 'job']
df_friend_no_head_change

    name   age        job
0   John  20.0    student
1  Jenny  30.0  developer
2   Nate  30.0    teacher
3  Julia  40.0    dentist
4  Brian  45.0    manager

#### 5.아래와 같은 데이터프레임을 만들어 보세요.

	name	age	job
------------------------------------
0  John  20  student
1  Jenny  30  developer
2  Nate  30  teacher

In [7]:
df_5 = pd.DataFrame({
    'name': ['John', 'Jenny', 'Nate'],
    'age': [20, 30, 30],
    'job': [ 'student', 'developer', 'teacher']
           
})
df_5

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

#### 6. 1부터 3까지 행(row)을 출력해 보세요.(순차적 선택)

In [8]:
df_5.iloc[0:3]

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

#### 7. 0, 2번 행(row)을 선택해서 출력해 보세요.(순차적이지 않은 row 선택)

In [9]:
df_5.iloc[0:3:2]

   name  age      job
0  John   20  student
2  Nate   30  teacher

#### 8. 모든 행(row)을 보여주되, 열(column)은 0부터 1까지만 출력

In [10]:
df_5.iloc[:, [0, 1]]

    name  age
0   John   20
1  Jenny   30
2   Nate   30

#### 9. 모든 행(row)을 보여주되, 열(column) 0와 2만 출 출력

In [11]:
df_5.iloc[:, [0, 2]]

    name        job
0   John    student
1  Jenny  developer
2   Nate    teacher

#### 10. 데이터프레임에서 'name'과 'age' 열만 출력해 보세요.

In [12]:
df_5.loc[:,['name', 'age']]

    name  age
0   John   20
1  Jenny   30
2   Nate   30